// ============================================================================
// 
// ゆかりすたー NEBULA の基底用 ViewModel
// 
// ============================================================================

// ----------------------------------------------------------------------------
// YlSettingsWindowViewModel 以外のすべてのビューモデルの基底
// ----------------------------------------------------------------------------

using Shinta.ViewModels;

using System;

using YukaLister.Models.YukaListerModels;

namespace YukaLister.ViewModels
{
	internal class YlViewModel : BasicWindowViewModel
	{
		// ====================================================================
		// コンストラクター
		// ====================================================================

		// --------------------------------------------------------------------
		// メインコンストラクター
		// --------------------------------------------------------------------
		public YlViewModel(Boolean useLogWriter = true)
				: base(useLogWriter ? YlModel.Instance.EnvModel.LogWriter : null)
		{
		}
	}
}
