// ============================================================================
// 
// ゆかりすたー NEBULA の基底用 ViewModel
// 
// ============================================================================

// ----------------------------------------------------------------------------
// SplashWindowViewModel・タブ系ビューモデル以外のすべてのビューモデルの基底
// 現状は特に機能を有していないが、将来の拡張用
// ----------------------------------------------------------------------------

using Shinta.ViewModels;

using YukaLister.Models.YukaListerModels;

namespace YukaLister.ViewModels
{
	internal class YlViewModel : BasicWindowViewModel
	{
		// ====================================================================
		// コンストラクター
		// ====================================================================

		// --------------------------------------------------------------------
		// メインコンストラクター
		// --------------------------------------------------------------------
		public YlViewModel()
				: base(YlModel.Instance.EnvModel.LogWriter)
		{
		}
	}
}
