// ============================================================================
// 
// 楽曲情報データベースマスター検索ウィンドウの ViewModel（Visual Studio 用）
// 
// ============================================================================

// ----------------------------------------------------------------------------
// Visual Studio の XAML エディタは ViewModel がジェネリックだと表示できないため、
// 非ジェネリックの本クラスを作成。
// プログラム中では本クラスではなく SearchMasterWindowViewModel<T> を使うこと。
// ----------------------------------------------------------------------------

namespace YukaLister.ViewModels.SearchMasterWindowViewModels
{
	public class SearchMasterWindowViewModel : YlViewModel
	{
	}
}
