// ============================================================================
// 
// フォルダーごとの設定（アプリ動作時用、InDisk の IsExclude が false の場合のみインスタンス化する）
// 
// ============================================================================

// ----------------------------------------------------------------------------
// 
// ----------------------------------------------------------------------------

using System;
using System.Collections.Generic;

namespace YukaLister.Models.SharedMisc
{
	internal class FolderSettingsInMemory
	{
		// ====================================================================
		// コンストラクター
		// ====================================================================

		// --------------------------------------------------------------------
		// メインコンストラクター
		// --------------------------------------------------------------------
		public FolderSettingsInMemory()
		{
			FolderNameRules = YlCommon.CreateRuleDictionary();
		}

		// ====================================================================
		// public プロパティー
		// ====================================================================

		// --------------------------------------------------------------------
		// 設定
		// --------------------------------------------------------------------

		// ファイル命名規則（正規表現）
		public List<String> FileNameRules { get; set; } = new();

		// ファイル正規表現にマッチしたグループが表す項目（TFound のカラム名）
		public List<List<String>> FileRegexGroups { get; set; } = new();

		// フォルダー命名規則（辞書）
		public Dictionary<String, String?> FolderNameRules { get; set; }
	}
}
