// ============================================================================
// 
// ゆかりすたー NEBULA 共通で使用する定数
// 
// ============================================================================

// ----------------------------------------------------------------------------
//
// ----------------------------------------------------------------------------

using Shinta;
using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace YukaLister.Models.SharedMisc
{
	// ====================================================================
	// public 列挙子
	// ====================================================================

	// --------------------------------------------------------------------
	// フォルダーに対する操作の詳細
	// --------------------------------------------------------------------
	public enum FolderTaskDetail
	{
		// 追加詳細
		CacheToDisk,    // キャッシュ DB からディスク DB へコピー　※親の場合のみなり得る
		FindSubFolders, // サブフォルダーの検索
		AddFileName,    // 追加（ファイル名のみ）
		AddInfo,        // 追加（ファイルが追加されたレコードに対してその他の情報を付与）

		// 削除詳細
		Remove,         // 削除
	}

	// --------------------------------------------------------------------
	// フォルダーに対する操作の種類
	// --------------------------------------------------------------------
	public enum FolderTaskKind
	{
		Add,            // 追加
		Remove,         // 削除
	}

	// --------------------------------------------------------------------
	// フォルダーに対する操作の動作状況
	// --------------------------------------------------------------------
	public enum FolderTaskStatus
	{
		Queued,         // 待機
		Running,        // 実行中
		Error,          // エラー
		Done,           // 完了
	}

	// --------------------------------------------------------------------
	// ゆかりすたー NEBULA の動作状況
	// --------------------------------------------------------------------
	public enum YukaListerStatus
	{
		Ready,      // 待機
		Running,    // 実行中
		Error,      // エラー
					//__End__
	}

	// ====================================================================
	// public デリゲート
	// ====================================================================

	// TargetFolderInfo.IsOpen が変更された
	public delegate void IsOpenChanged(TargetFolderInfo targetFolderInfo);

	public class YlConstants
	{
		// ====================================================================
		// public 定数
		// ====================================================================

		// --------------------------------------------------------------------
		// アプリの基本情報
		// --------------------------------------------------------------------
		public const String APP_ID = "YukaLister";
		public const String APP_GENERATION = "NEBULA";
		public const String APP_NAME_J = "ゆかりすたー " + APP_GENERATION + " ";
		public const String APP_VER = "Ver 0.01 α";
		public const String COPYRIGHT_J = "Copyright (C) 2021 by SHINTA";

		// --------------------------------------------------------------------
		// フォルダー名
		// --------------------------------------------------------------------

		// ゆかりすたー用データベースを保存するフォルダー名
		public const String FOLDER_NAME_DATABASE = "Database\\";

		// ゆかり用データベースを保存するフォルダー名
		public const String FOLDER_NAME_LIST = "list\\";

		// --------------------------------------------------------------------
		// ファイル名
		// --------------------------------------------------------------------
		public const String FILE_NAME_YUKARI_CONFIG = "config" + Common.FILE_EXT_INI;

		// --------------------------------------------------------------------
		// MessageKey
		// --------------------------------------------------------------------

		// ウィンドウを閉じる
		public const String MESSAGE_KEY_WINDOW_CLOSE = "Close";

		// --------------------------------------------------------------------
		// その他
		// --------------------------------------------------------------------

		// DPI
		public const Single DPI = 96.0f;
	}
}
