// ============================================================================
// 
// 楽曲情報データベースマスター一覧ウィンドウの ViewModel（Visual Studio 用）
// 
// ============================================================================

// ----------------------------------------------------------------------------
// Visual Studio の XAML エディタは ViewModel がジェネリックだと表示できないため、
// 非ジェネリックの本クラスを作成。
// プログラム中では本クラスではなく派生クラスを使うこと。
// ----------------------------------------------------------------------------

namespace YukaLister.ViewModels.ViewMastersWindowViewModels
{
	internal class ViewMastersWindowViewModel : YlViewModel
	{
	}
}
