// ============================================================================
// 
// リストデータベース（ゆかり用：ディスク）のコンテキスト
// 
// ============================================================================

// ----------------------------------------------------------------------------
//
// ----------------------------------------------------------------------------

using Shinta;
using YukaLister.Models.DatabaseAssist;
using YukaLister.Models.YukaListerModels;

namespace YukaLister.Models.DatabaseContexts;

internal partial class ListContextInDisk : ListContext
{
	// ====================================================================
	// コンストラクター
	// ====================================================================

	// --------------------------------------------------------------------
	// メインコンストラクター
	// --------------------------------------------------------------------
	public ListContextInDisk()
			: base("ゆかり用リスト")
	{
	}

	// ====================================================================
	// public 関数
	// ====================================================================

	// --------------------------------------------------------------------
	// データベースのフルパス
	// --------------------------------------------------------------------
	public override String DatabasePath()
	{
#if YUKALISTER
		return DbCommon.ListDatabasePath(YlModel.Instance.EnvModel.YlSettings);
#endif
#if MOCHIKARA_PRODUCER
		// デバッグ用
		return @"C:\Temp\List" + Common.FILE_EXT_SQLITE3;
#endif
	}
}
