// ============================================================================
// 
// 紐付編集ウィンドウの ViewModel（Visual Studio 用）
// 
// ============================================================================

// ----------------------------------------------------------------------------
// Visual Studio の XAML エディタは ViewModel がジェネリックだと表示できないため、
// 非ジェネリックの本クラスを作成。
// プログラム中では本クラスではなく派生クラスを使うこと。
// ----------------------------------------------------------------------------

namespace YukaLister.ViewModels.EditSequenceWindowViewModels
{
	public class EditSequenceWindowViewModel : YlViewModel
	{
	}
}
